{"user_id": "8842281e1d1347389f2ab93d60773d4d", "timestamp": "2017-08-30", "review_sentences": [[0, "This is a special book."], [0, "It started slow for about the first third, then in the middle third it started to get interesting, then the last third blew my mind."], [0, "This is what I love about good science fiction - it pushes your thinking about where things can go."], [0, "It is a 2015 Hugo winner, and translated from its original Chinese, which made it interesting in just a different way from most things I've read."], [0, "For instance the intermixing of Chinese revolutionary history - how they kept accusing people of being \"reactionaries\", etc."], [0, "It is a book about science, and aliens."], [0, "The science described in the book is impressive - its a book grounded in physics and pretty accurate as far as I could tell."], [1, "Though when it got to folding protons into 8 dimensions I think he was just making stuff up - interesting to think about though."], [1, "But what would happen if our SETI stations received a message - if we found someone was out there - and the person monitoring and answering the signal on our side was disillusioned?"], [1, "That part of the book was a bit dark - I would like to think human reaction to discovering alien civilization that is hostile would be more like Enders Game where we would band together."], [1, "I did like how the book unveiled the Trisolaran culture through the game."], [1, "It was a smart way to build empathy with them and also understand what they've gone through across so many centuries."], [1, "And who know a 3 body problem was an unsolvable math problem?"], [1, "But I still don't get who made the game - maybe that will come in the next book."], [1, "I loved this quote:"], [1, "\"In the long history of scientific progress, how many protons have been smashed apart in accelerators by physicists?"], [1, "How many neutrons and electrons?"], [1, "Probably no fewer than a hundred million."], [1, "Every collision was probably the end of the civilizations and intelligences in a microcosmos."], [1, "In fact, even in nature, the destruction of universes must be happening at every second--for example, through the decay of neutrons."], [1, "Also, a high-energy cosmic ray entering the atmosphere may destroy thousands of such miniature universes....\""]], "rating": 5, "has_spoiler": true, "book_id": "18245960", "review_id": "dfdbb7b0eb5a7e4c26d59a937e2e5feb"}